# 1. Виміряти швидкість роботи твоїх views, виконавши послідовні виклики
# різних ендпоінтів. Виміряти швидкість роботи кожного view окремо, а також
# сумарну кількість секунд, витрачену на всі запити. Використай HTTPX, Requests
# або Postman для тесту.
# 2. Оновити views в твоєму додатку з синхронного підходу на асинхронний.
# 3. Ще раз виміряти швидкість роботи твого сайту, але для асинхронного підходу.
# Чи виявився асинхронний підхід швидшим?
pip install httpx
# Перший вимір: Запустити сервер python manage.py runserver і виконати в іншому
# терміналі python benchmark.py. Записати результати.
# На синхронних views асинхронний тест може дати виграш лише за рахунок
# HTTP-пулінгу, але сервер все одно оброблятиме їх послідовно в одному потоці.

pip install uvicorn
uvicorn notes_app.asgi:application --port 8000
python benchmark.py