# Task 1
# Напишіть програму на Python для визначення кількості локальних змінних, оголошених у функції.
# Щоб підрахувати кількість локальних змінних у функції в Python, скористаємось атрибутом об'єкта
# коду __code__.co_nlocals.
# __code__: Це спеціальний атрибут функції, який містить скомпільований байт-код та метадані.
# co_nlocals: Це ціле число, яке зберігає загальну кількість локальних імен, визначених у функції
# (включаючи аргументи).
def my_function():
    a = 13
    b = "Привіт"
    c = [11, 22, 33]
    d = True

def count_locals(func):
    return func.__code__.co_nlocals

# Використання
count = count_locals(my_function)
print(f"Кількість локальних змінних у функції: {count}")

# Task 2
# Напишіть програму на Python для виклику функції всередині функції (Підказка: використовуйте
# функцію, яка повертає іншу функцію)
# outer_function створює локальний простір імен, де визначається inner_function
def outer_function(message):
    # Внутрішня функція
    def inner_function():
        print(f"Повідомлення зсередини: {message}")

    # Повертаємо саму функцію (без дужок!)
    # Замість того, щоб виконати inner_function одразу, ми повертаємо її як об'єкт
    return inner_function


# Отримуємо доступ до внутрішньої функції
# Змінна my_func тепер посилається на внутрішню функцію і «пам'ятає» контекст (аргумент message),
# у якому вона була створена.
my_func = outer_function("Привіт, це замикання!")

# Викликаємо її пізніше
my_func()




