# Task 1
# Файли
# Напишіть скрипт, який створює новий вихідний файл із назвою myfile.txt і записує в нього рядок
# «Hello file world!». Потім напишіть інший скрипт, який відкриває файл myfile.txt, зчитує його
# вміст і виводить його на екран. Запустіть обидва скрипти з командного рядка системи.
# Чи з’являється новий файл у каталозі, де ви запустили скрипти?
# Що станеться, якщо ви додасте інший шлях до каталогу до імені файлу, що передається функції open?
# Примітка: методи запису файлів не додають символи нового рядка до ваших рядків; додайте явний
# символ «\n» в кінці рядка, якщо ви хочете повністю завершити рядок у файлі.

# python write_file.py
# python read_file.py
# для запуску файлів необхідно їх створити D:\2026

import os

# Отримуємо повний шлях до папки, де лежить цей скрипт
current_dir = os.path.dirname(os.path.abspath(__file__))
file_path = os.path.join(current_dir, "home_work_11/myfile.txt")

print(f"Скрипт намагається створити файл тут: {file_path}")

try:
# записуємо файл
    with open(file_path, "w", encoding="utf-8") as f:
        f.write("Hello file world!\n")
    print(" Файл успішно створено!")

# читаємо
    if os.path.exists(file_path):
        with open(file_path, "r", encoding="utf-8") as f:
            content = f.read()
            print(f" Вміст файлу: {content}")
    else:
        print("❌ Дивно, але файл не знайдено на диску після запису.")

except Exception as e:
    print(f"❗ Сталася помилка: {e}")

# Task 2
# Розширення програми «Телефонна книга»
# Функціональні можливості програми «Телефонна книга»:
# Додавання нових записів
# Пошук за іменем
# Пошук за прізвищем
# Пошук за повним ім'ям
# Пошук за номером телефону
# Пошук за містом або областю
# Видалення запису за вказаним номером телефону
# Оновлення запису за вказаним номером телефону
# Опція виходу з програми
# Першим аргументом програми має бути назва телефонної книги. Програма повинна завантажити дані
# у форматі JSON, якщо вони присутні у папці з програмою, інакше вивести повідомлення про помилку.
# Після виходу користувача всі дані повинні бути збережені у завантаженому файлі JSON.


