# Task 1 
# На операційну систему Linux Ubuntu 24.04 встановлений інтерпретатор Python, IDE Spyder. Опрацьовано використання Python в терміналі в 2 режимах.

# Task 2
# Створений файл task.py в якому опрацьовано функцію print з параметрами sep, end, 
# Виконистання функції print
print("Hello world!")
# Використання параметра "end"
print("Today", end=": ")
# Використання параметра "sep"
print("25", "02", "2026", sep="-")

# Task 3
print("\n","#"*9,"\n","#","\t"*2,"#","\n","#","\t"*2,"#","\n","#","\t"*2,"#","\n","#"*9)
print("\n","#","\t"*2,"#","\n","#","\t"*2,"#","\n","#"*9,"\n","#","\t"*2,"#","\n","#","\t"*2,"#")

