# Task 1
#Гра «Вгадай число».
#Напишіть програму, яка генерує випадкове число від 1 до 10 і пропонує користувачеві вгадати,
# яке саме число було згенеровано.
# Результат слід вивести користувачеві за допомогою оператора print.
import random

# Генеруємо випадкове число від 1 до 10
secret_number = random.randint(1, 10)
# print(f" {secret_number}")

# Отримуємо відповідь від користувача та перетворюємо її на ціле число (int)
guess = int(input("Вгадайте число від 1 до 10: "))

# Перевіряємо результат
if guess == secret_number:
    print("Вітаю! Ви вгадали число!")
else:
    print(f"Ви не вгадали. Було загадано число {secret_number}.")

# Task 2
# Програма для привітання з днем народження.#
# Напишіть програму, яка приймає в якості вхідних даних ваше ім’я,
# а потім ваш вік і вітає вас таким повідомленням:#
# «Привіт, <ім’я>! На наступний день народження тобі виповниться <вік+1> років»
name = input("Введіть ваше ім'я: ")
age = int(input("Введіть ваш вік: "))

next_age = age + 1

print(f"Привіт {name}! На наступний день народження тобі виповниться {next_age} років")

# Task 3
# Комбінації слів
# Створіть програму, яка зчитує вхідний рядок, а потім формує та виводить 5 випадкових рядків
# із символів цього вхідного рядка.
# Наприклад, програма отримала слово «hello», тому вона повинна вивести
# 5 випадкових рядків (слів), що поєднують символи
# “h”, “e”, “l”, “l”, “o” -> “hlelo”, “olelh”, “loleh” …
# Підказки: Використовуйте модуль random для отримання випадкового символу з рядка)
import random

word = input("Введіть слово: ")

print(f"5 випадкових комбінацій із літер '{word}':")

for _ in range(5):
    # random.sample повертає список випадкових символів заданої довжини
    char_list = random.sample(word, len(word))
    # ''.join() з'єднує список символів назад у рядок
    random_word = ''.join(char_list)
    print(random_word)