# Створити сторінку автентифікації користувача
# Створити кнопку log out для виходу користувача з системи.
# Створити супер’юзера, який може мати доступ до адмінки. Спробувати
# додати чи видалити нових користувачів за допомогою Django-адмінки.
# Оновити модель нотаток так, щоб вона мала вказівку на користувача,
# який створив цю нотатку.
# Обновити views так, щоб тільки автентифікований користувач мав доступ
# до перегляду, оновлення та видалення лише своїх нотаток.
# Extra
# Створити групу, нотатки якої будуть доступні для перегляду усім
# користувачам цієї групи.
# Додати до основної сторінки можливість переключатися між персональними
# нотатками та нотатками групи.
python manage.py createsuperuser
# Термінал запросить ввести username, email та пароль.
# Після цього запустіть сервер (python manage.py runserver),
# перейдіть за адресою http://127.0.0 та увійдіть під цими даними.
# Там ви зможете додавати, редагувати та видаляти нових користувачів.
# Після оновлення моделей виконайте команди в терміналі:
python manage.py makemigrations
python manage.py migrate
